In [1]:
import numpy as np
import pandas as pd

In [2]:
#read in; had to use converters b/c the truck names had mixed types
df = pd.read_csv("plow20170315.csv", converters={'truck_name': str})

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65714 entries, 0 to 65713
Data columns (total 8 columns):
truck_name       65714 non-null object
repair_type      65714 non-null object
date_fixed       65714 non-null object
date_fixed1      65714 non-null object
address          65714 non-null object
activity_type    65714 non-null object
longitude        65714 non-null float64
latitude         65714 non-null float64
dtypes: float64(2), object(6)
memory usage: 4.0+ MB

In [56]:
df.head()

,truck_name,repair_type,date_fixed,date_fixed1,address,activity_type,longitude,latitude
0,283,SNOW & ICE,2017-03-15 00:00:01.000,2017-03-15 00:00:02.000,1216 CANAL ST REAR ...,Ignition On,-76.112274,43.054979
1,265,SNOW & ICE,2017-03-15 00:00:04.000,2017-03-15 00:00:05.000,1212 CANAL ST ...,,-76.114741,43.054065
2,284,SNOW & ICE,2017-03-15 00:00:04.000,2017-03-15 00:00:05.000,123 STANDART ST ...,Start Moving,-76.139915,43.034899
3,286,SNOW & ICE,2017-03-15 00:00:06.000,2017-03-15 00:00:06.000,217 GEDDES ST S ...,,-76.171008,43.044902
4,266,SNOW & ICE,2017-03-15 00:00:07.000,2017-03-15 00:00:08.000,404 TOWNSEND ST N & WILLOW ST ...,,-76.146576,43.054486

In [4]:
# get rid of columns I don't need
df2 = df[['truck_name','date_fixed','longitude','latitude']]

In [58]:
df2.head()

         truck_name               date_fixed  longitude   latitude
0  283               2017-03-15 00:00:01.000 -76.112274  43.054979
1  265               2017-03-15 00:00:04.000 -76.114741  43.054065
2  284               2017-03-15 00:00:04.000 -76.139915  43.034899
3  286               2017-03-15 00:00:06.000 -76.171008  43.044902
4  266               2017-03-15 00:00:07.000 -76.146576  43.054486

In [5]:
#sorted by truck then date/time
df3 = df2.sort_values(by=['truck_name','date_fixed'],na_position='first')

In [28]:
#test subset 
df4= df3[15000:15200]

In [29]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 4693 to 8175
Data columns (total 4 columns):
truck_name    200 non-null object
date_fixed    200 non-null object
longitude     200 non-null float64
latitude      200 non-null float64
dtypes: float64(2), object(2)
memory usage: 7.8+ KB

In [30]:
df4.head()

            truck_name               date_fixed  longitude   latitude
4693  258               2017-03-15 01:40:25.000 -76.119779  43.046386
4701  258               2017-03-15 01:40:37.000 -76.119724  43.045678
4710  258               2017-03-15 01:40:50.000 -76.119712  43.045540
4721  258               2017-03-15 01:41:02.000 -76.119663  43.045169
4768  258               2017-03-15 01:42:01.000 -76.119639  43.044869

In [6]:
# get the manhattan distance between consecutive data points
df3['manh_dist'] = abs(df3.longitude - df3.longitude.shift()) + abs(df3.latitude - df3.latitude.shift())

In [7]:
df3.head()

,truck_name,date_fixed,longitude,latitude,manh_dist
9,178,2017-03-15 00:00:11.000,-76.109251,43.055242,NaN
55,178,2017-03-15 00:01:11.000,-76.109247,43.055258,0.000020
102,178,2017-03-15 00:02:11.000,-76.109249,43.055274,0.000018
142,178,2017-03-15 00:03:11.000,-76.109263,43.055258,0.000030
187,178,2017-03-15 00:04:11.000,-76.109240,43.055317,0.000083

In [62]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65714 entries, 9 to 62609
Data columns (total 5 columns):
truck_name    65714 non-null object
date_fixed    65714 non-null object
longitude     65714 non-null float64
latitude      65714 non-null float64
manh_dist     65713 non-null float64
dtypes: float64(3), object(2)
memory usage: 3.0+ MB

In [8]:
#A Manhattan distance of .001 is ~160 meters
df3[df3.manh_dist > .001].count()

truck_name    15924
date_fixed    15924
longitude     15924
latitude      15924
manh_dist     15924
dtype: int64

In [48]:
15936/65714

0.24250540219740085

In [64]:
df3[df3.manh_dist > .0007].count()

truck_name    20229
date_fixed    20229
longitude     20229
latitude      20229
manh_dist     20229
dtype: int64

In [65]:
df3[df3.manh_dist > .0005].count()

truck_name    25292
date_fixed    25292
longitude     25292
latitude      25292
manh_dist     25292
dtype: int64

In [9]:
#how many data points per truck
df3.groupby('truck_name').size()

truck_name
178                 2633
179                    1
182                 1266
206                    7
208                 3344
210                 4056
212                  333
216                 2360
253                    1
254                   84
257                  737
258                 3536
259                 3604
261                 3549
262                 3996
263                 1118
264                 3142
265                 2691
266                 3464
267                 3050
268                 2917
269                    1
270                 2876
271                 4036
281                    1
282                  809
283                 1833
284                 2701
285                 2718
286                 3515
73                  1334
S216                   1
dtype: int64

In [102]:
#testing strip()
trck_stripped = df3.truck_name.str.strip()

In [10]:
#stripping white space from the truck names
df3['truck_name'] = df3['truck_name'].str.strip()

In [11]:
#create a data frame only containing data for truck 210
truck_210 = df3[df3.truck_name == '210']

In [12]:
truck_210.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4056 entries, 31 to 65697
Data columns (total 5 columns):
truck_name    4056 non-null object
date_fixed    4056 non-null object
longitude     4056 non-null float64
latitude      4056 non-null float64
manh_dist     4056 non-null float64
dtypes: float64(3), object(2)
memory usage: 190.1+ KB

In [ ]:
#TO DO: figure out best way of getting rid of spacially proximal data points without losing too much information
# Perhaps map out all of the data points first, then try different techniques and map those.

In [ ]:
#TO DO: figure out how the final JSON object will need to be structured, and how to get to that point

In [13]:
truck_210.head()

   truck_name               date_fixed  longitude   latitude  manh_dist
31        210  2017-03-15 00:00:40.000 -76.141890  43.072444   0.038326
43        210  2017-03-15 00:00:58.000 -76.141898  43.072428   0.000024
46        210  2017-03-15 00:01:00.000 -76.141881  43.072390   0.000055
52        210  2017-03-15 00:01:08.000 -76.141762  43.072206   0.000303
98        210  2017-03-15 00:02:08.000 -76.134908  43.072551   0.007200

In [106]:
test_row_iter = pd.DataFrame(np.random.randn(20,3),columns=list('ABC'))

In [107]:
test_row_iter

           A         B         C
0   1.474800 -1.004912 -0.421810
1   0.542508 -1.905714  0.638860
2  -1.337986 -1.792550  0.015706
3   0.278138  1.766619 -0.384126
4   0.028452 -0.321631  1.057234
5   0.365070 -0.282689  0.212962
6  -1.797415 -0.612811  0.859768
7   0.037178  1.038604  0.478687
8  -1.510556  0.566905 -0.632473
9   0.066884 -0.247131 -0.314906
10 -0.105415 -1.154694  0.742391
11  1.222499 -0.409779 -0.443888
12  0.698096 -0.169414  1.740479
13  1.261553  1.006712  1.288986
14 -0.251246 -0.807989  0.196720
15 -1.590681  0.064995 -0.205878
16 -0.882508  1.311705 -0.144198
17  0.189581 -0.150966  1.592357
18 -0.417860  0.907654 -1.177053
19 -0.339478 -0.497426 -0.324811

In [108]:
#for testing: set column C to absolute values
test_row_iter['C'] = abs(test_row_iter['C'])

In [85]:
#how to iterate over rows and set a boolean value based on a conditional
for i in range(1,len(test_row_iter)):
    if test_row_iter.loc[i, 'C'] > 0:
        test_row_iter.loc[i,'D'] = True

In [109]:
#set first boolean of the 'Keep' column to 'True', since we always want to keep the first data point
test_row_iter.loc[0,'Keep'] = True
#create a boolean column based on an the accumulated value of a column
threshhold = 2.
cum_dist = 0.
for i in range(1,len(test_row_iter)):
    if test_row_iter.loc[i, 'C'] + cum_dist > threshhold:
        test_row_iter.loc[i,'Keep'] = True
        cum_dist = 0
    else:
        test_row_iter.loc[i,'Keep'] = False
        cum_dist += test_row_iter.loc[i, 'C']

In [110]:
test_row_iter

           A         B         C  Keep
0   1.474800 -1.004912  0.421810  True
1   0.542508 -1.905714  0.638860   NaN
2  -1.337986 -1.792550  0.015706   NaN
3   0.278138  1.766619  0.384126   NaN
4   0.028452 -0.321631  1.057234  True
5   0.365070 -0.282689  0.212962   NaN
6  -1.797415 -0.612811  0.859768   NaN
7   0.037178  1.038604  0.478687   NaN
8  -1.510556  0.566905  0.632473  True
9   0.066884 -0.247131  0.314906   NaN
10 -0.105415 -1.154694  0.742391   NaN
11  1.222499 -0.409779  0.443888   NaN
12  0.698096 -0.169414  1.740479  True
13  1.261553  1.006712  1.288986   NaN
14 -0.251246 -0.807989  0.196720   NaN
15 -1.590681  0.064995  0.205878   NaN
16 -0.882508  1.311705  0.144198   NaN
17  0.189581 -0.150966  1.592357  True
18 -0.417860  0.907654  1.177053   NaN
19 -0.339478 -0.497426  0.324811   NaN